[Killed] BlockStatement
src/services/CheckoutService.js:15:50
  * "return pedidoSalvo | null" of the legacy code (Replace Return-of-null).
  */
 class CheckoutResult {
-  constructor({ success, order, reason = null }) {
-    this.success = success;
-    this.order = order;
-    this.reason = reason;
-  }
+  constructor({ success, order, reason = null }) {}
 
   static approved(order) {
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:21:26
     this.reason = reason;
   }
 
-  static approved(order) {
-    return new CheckoutResult({ success: true, order });
-  }
+  static approved(order) {}
 
   static rejected(order, reason) {
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/services/CheckoutService.js:22:42
   }
 
   static approved(order) {
-    return new CheckoutResult({ success: true, order });
+    return new CheckoutResult({ success: false, order });
   }
 
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/services/CheckoutService.js:22:31
   }
 
   static approved(order) {
-    return new CheckoutResult({ success: true, order });
+    return new CheckoutResult({});
   }
 
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:25:34
     return new CheckoutResult({ success: true, order });
   }
 
-  static rejected(order, reason) {
-    return new CheckoutResult({ success: false, order, reason });
-  }
+  static rejected(order, reason) {}
 }
 
killedBy: CheckoutService — Fluxo 2: Pagamento Recusado (RN03) marca o pedido como FALHOU e retorna insucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/services/CheckoutService.js:26:42
   }
 
   static rejected(order, reason) {
-    return new CheckoutResult({ success: false, order, reason });
+    return new CheckoutResult({ success: true, order, reason });
   }
 }
killedBy: CheckoutService — Fluxo 2: Pagamento Recusado (RN03) marca o pedido como FALHOU e retorna insucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/CheckoutService.js:45:79
  * Stubs (state) and Mocks (behaviour) of Fase 2 possible.
  */
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService, options = {}) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-
-    this.validator = options.validator || new OrderValidator();
-    this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
-    this.timeoutMs = options.timeoutMs ?? 2000;
-    this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService, options = {}) {}
 
   /**
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] ConditionalExpression
src/services/CheckoutService.js:50:22
     this.pedidoRepository = pedidoRepository;
     this.emailService = emailService;
 
-    this.validator = options.validator || new OrderValidator();
+    this.validator = false;
     this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
     this.timeoutMs = options.timeoutMs ?? 2000;
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: TypeError: this.validator.validate is not a function

[Killed] ConditionalExpression
src/services/CheckoutService.js:50:22
     this.pedidoRepository = pedidoRepository;
     this.emailService = emailService;
 
-    this.validator = options.validator || new OrderValidator();
+    this.validator = true;
     this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
     this.timeoutMs = options.timeoutMs ?? 2000;
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: TypeError: this.validator.validate is not a function

[Killed] LogicalOperator
src/services/CheckoutService.js:51:20
     this.emailService = emailService;
 
     this.validator = options.validator || new OrderValidator();
-    this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
+    this.breaker = options.circuitBreaker && new CircuitBreaker(options.breakerOptions);
     this.timeoutMs = options.timeoutMs ?? 2000;
     this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/CheckoutService.js:51:20
     this.emailService = emailService;
 
     this.validator = options.validator || new OrderValidator();
-    this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
+    this.breaker = false;
     this.timeoutMs = options.timeoutMs ?? 2000;
     this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] LogicalOperator
src/services/CheckoutService.js:52:22
 
     this.validator = options.validator || new OrderValidator();
     this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
-    this.timeoutMs = options.timeoutMs ?? 2000;
+    this.timeoutMs = options.timeoutMs && 2000;
     this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
   }

[Timeout] LogicalOperator
src/services/CheckoutService.js:53:25
     this.validator = options.validator || new OrderValidator();
     this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
     this.timeoutMs = options.timeoutMs ?? 2000;
-    this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
+    this.retryOptions = options.retryOptions && {
+  maxRetries: 3,
+  backoffMs: 500,
+  jitter: 0.2
+};
   }
 

[Timeout] ConditionalExpression
src/services/CheckoutService.js:53:25
     this.validator = options.validator || new OrderValidator();
     this.breaker = options.circuitBreaker || new CircuitBreaker(options.breakerOptions);
     this.timeoutMs = options.timeoutMs ?? 2000;
-    this.retryOptions = options.retryOptions || { maxRetries: 3, backoffMs: 500, jitter: 0.2 };
+    this.retryOptions = true;
   }
 

[Killed] BlockStatement
src/services/CheckoutService.js:59:27
   /**
    * @returns {Promise<CheckoutResult>}
    */
-  async processar(pedido) {
-    this.validator.validate(pedido); // RN01 — throws ValidationError, never persists
-
-    let gatewayResponse;
-    try {
-      gatewayResponse = await this._chargeWithResilience(pedido);
-    } catch (error) {
-      return this._handleInfrastructureFailure(pedido, error);
-    }
-
-    if (this._isApproved(gatewayResponse)) {
-      return this._handleApproved(pedido);
-    }
-    return this._handleDeclined(pedido);
-  }
+  async processar(pedido) {}
 
   // --- resilience composition (RN04/05/06/07) ---------------------------
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
src/services/CheckoutService.js:63:9
     this.validator.validate(pedido); // RN01 — throws ValidationError, never persists
 
     let gatewayResponse;
-    try {
-      gatewayResponse = await this._chargeWithResilience(pedido);
-    } catch (error) {
+    try {} catch (error) {
       return this._handleInfrastructureFailure(pedido, error);
     }
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CheckoutService.js:65:21
     let gatewayResponse;
     try {
       gatewayResponse = await this._chargeWithResilience(pedido);
-    } catch (error) {
-      return this._handleInfrastructureFailure(pedido, error);
-    }
+    } catch (error) {}
 
     if (this._isApproved(gatewayResponse)) {
killedBy: CheckoutService — Fluxo 4: Caos Total / Fallback (RN07) esgota retentativas e aciona fallback ERRO_GATEWAY
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ERRO_GATEWAY"
Received: "FALHOU"

[Killed] ConditionalExpression
src/services/CheckoutService.js:69:9
       return this._handleInfrastructureFailure(pedido, error);
     }
 
-    if (this._isApproved(gatewayResponse)) {
+    if (true) {
       return this._handleApproved(pedido);
     }
killedBy: CheckoutService — Fluxo 2: Pagamento Recusado (RN03) marca o pedido como FALHOU e retorna insucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/CheckoutService.js:69:9
       return this._handleInfrastructureFailure(pedido, error);
     }
 
-    if (this._isApproved(gatewayResponse)) {
+    if (false) {
       return this._handleApproved(pedido);
     }
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CheckoutService.js:77:33
 
   // --- resilience composition (RN04/05/06/07) ---------------------------
 
-  _chargeWithResilience(pedido) {
-    return this.breaker.execute(() =>
-      retry(
-        () => withTimeout(
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          this.timeoutMs,
-        ),
-        this.retryOptions,
-      ),
-    );
-  }
+  _chargeWithResilience(pedido) {}
 
   _isApproved(response) {
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/services/CheckoutService.js:78:33
   // --- resilience composition (RN04/05/06/07) ---------------------------
 
   _chargeWithResilience(pedido) {
-    return this.breaker.execute(() =>
-      retry(
-        () => withTimeout(
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          this.timeoutMs,
-        ),
-        this.retryOptions,
-      ),
+    return this.breaker.execute(() => undefined,
     );
   }
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/services/CheckoutService.js:80:9
   _chargeWithResilience(pedido) {
     return this.breaker.execute(() =>
       retry(
-        () => withTimeout(
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          this.timeoutMs,
-        ),
+        () => undefined,
         this.retryOptions,
       ),
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CheckoutService.js:89:25
     );
   }
 
-  _isApproved(response) {
-    return Boolean(response) && response.status === GatewayStatus.APPROVED;
-  }
+  _isApproved(response) {}
 
   // --- outcome handlers (Replace Conditional with explicit methods) ------
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "FALHOU"

[Killed] LogicalOperator
src/services/CheckoutService.js:90:12
   }
 
   _isApproved(response) {
-    return Boolean(response) && response.status === GatewayStatus.APPROVED;
+    return Boolean(response) || response.status === GatewayStatus.APPROVED;
   }
 
killedBy: Processamento de Checkout da EntregasJá Cartão recusado não dispara e-mail (Fluxo 2)
statusReason: Error: jest-cucumber: o pedido deve ter status "FALHOU" (line 20)

expect(received).toBe(expected) // Object.is equality

Expected: "FALHOU"
Received: "PROCESSADO"

[Killed] EqualityOperator
src/services/CheckoutService.js:90:33
   }
 
   _isApproved(response) {
-    return Boolean(response) && response.status === GatewayStatus.APPROVED;
+    return Boolean(response) && response.status !== GatewayStatus.APPROVED;
   }
 
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "FALHOU"

[Killed] BlockStatement
src/services/CheckoutService.js:95:33
 
   // --- outcome handlers (Replace Conditional with explicit methods) ------
 
-  async _handleApproved(pedido) {
-    pedido.status = OrderStatus.PROCESSED; // RN02
-    const saved = await this.pedidoRepository.salvar(pedido);
-    // RN02: e-mail is fire-and-forget (non-blocking) — must NOT hold the response.
-    this._notifyAsync(pedido.clienteEmail, 'Pagamento Aprovado');
-    return CheckoutResult.approved(saved);
-  }
+  async _handleApproved(pedido) {}
 
   async _handleDeclined(pedido) {
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/services/CheckoutService.js:103:33
     return CheckoutResult.approved(saved);
   }
 
-  async _handleDeclined(pedido) {
-    pedido.status = OrderStatus.FAILED; // RN03
-    const saved = await this.pedidoRepository.salvar(pedido);
-    // RN03 critical rule: NO confirmation e-mail on decline.
-    return CheckoutResult.rejected(saved, 'pagamento_recusado');
-  }
+  async _handleDeclined(pedido) {}
 
   async _handleInfrastructureFailure(pedido, error) {
killedBy: Processamento de Checkout da EntregasJá Cartão recusado não dispara e-mail (Fluxo 2)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "FALHOU" (line 20)

Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/services/CheckoutService.js:110:53
     return CheckoutResult.rejected(saved, 'pagamento_recusado');
   }
 
-  async _handleInfrastructureFailure(pedido, error) {
-    pedido.status = OrderStatus.GATEWAY_ERROR; // RN07 fallback
-    const saved = await this.pedidoRepository.salvar(pedido);
-    return CheckoutResult.rejected(saved, error instanceof InfrastructureError
-      ? error.name
-      : 'erro_desconhecido');
-  }
+  async _handleInfrastructureFailure(pedido, error) {}
 
   /**
killedBy: Processamento de Checkout da EntregasJá Queda total do gateway aciona fallback (Fluxo 4)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "ERRO_GATEWAY" (line 33)

Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/services/CheckoutService.js:122:32
    * Fire-and-forget notification (RN02). Failures are swallowed and logged so a
    * flaky SMTP provider can never break or delay a successful checkout.
    */
-  _notifyAsync(email, message) {
-    Promise.resolve()
-      .then(() => this.emailService.enviarConfirmacao(email, message))
-      .catch((err) => console.error('Falha ao enviar e-mail de confirmacao:', err.message));
-  }
+  _notifyAsync(email, message) {}
 }
 
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o e-mail de confirmação deve ser enviado (line 14)

expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/services/CheckoutService.js:124:13
    */
   _notifyAsync(email, message) {
     Promise.resolve()
-      .then(() => this.emailService.enviarConfirmacao(email, message))
+      .then(() => undefined)
       .catch((err) => console.error('Falha ao enviar e-mail de confirmacao:', err.message));
   }
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o e-mail de confirmação deve ser enviado (line 14)

expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ArrowFunction
src/services/CheckoutService.js:125:14
   _notifyAsync(email, message) {
     Promise.resolve()
       .then(() => this.emailService.enviarConfirmacao(email, message))
-      .catch((err) => console.error('Falha ao enviar e-mail de confirmacao:', err.message));
+      .catch(() => undefined);
   }
 }
