[Survived] StringLiteral
src/services/CircuitBreaker.js:6:11
 const { CircuitOpenError } = require('../errors');
 
 const State = Object.freeze({
-  CLOSED: 'CLOSED',     // normal operation
+  CLOSED: "",     // normal operation
   OPEN: 'OPEN',         // failing fast, gateway calls suspended
   HALF_OPEN: 'HALF_OPEN', // probing whether the gateway recovered

[Survived] StringLiteral
src/services/CircuitBreaker.js:7:9
 
 const State = Object.freeze({
   CLOSED: 'CLOSED',     // normal operation
-  OPEN: 'OPEN',         // failing fast, gateway calls suspended
+  OPEN: "",         // failing fast, gateway calls suspended
   HALF_OPEN: 'HALF_OPEN', // probing whether the gateway recovered
 });

[Killed] BlockStatement
src/services/CircuitBreaker.js:31:11
     cooldownMs = 10000,
     minimumCalls = 5,
     now = Date.now,
-  } = {}) {
-    this.errorThreshold = errorThreshold;
-    this.window = window;
-    this.cooldownMs = cooldownMs;
-    this.minimumCalls = minimumCalls;
-    this.now = now;
-
-    this.state = State.CLOSED;
-    this.results = []; // rolling log of booleans: true = success
-    this.openedAt = null;
-  }
+  } = {}) {}
 
   async execute(operation) {
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/CircuitBreaker.js:43:28
     this.openedAt = null;
   }
 
-  async execute(operation) {
-    if (this.state === State.OPEN) {
-      if (this.now() - this.openedAt >= this.cooldownMs) {
-        this.state = State.HALF_OPEN;
-      } else {
-        throw new CircuitOpenError();
-      }
-    }
-
-    try {
-      const result = await operation();
-      this._onSuccess();
-      return result;
-    } catch (error) {
-      this._onFailure();
-      throw error;
-    }
-  }
+  async execute(operation) {}
 
   _record(success) {
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "FALHOU"

[Killed] BlockStatement
src/services/CircuitBreaker.js:44:36
   }
 
   async execute(operation) {
-    if (this.state === State.OPEN) {
-      if (this.now() - this.openedAt >= this.cooldownMs) {
-        this.state = State.HALF_OPEN;
-      } else {
-        throw new CircuitOpenError();
-      }
-    }
+    if (this.state === State.OPEN) {}
 
     try {
killedBy: CircuitBreaker (RN07) falha rapido com CircuitOpenError enquanto aberto
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:44:9
   }
 
   async execute(operation) {
-    if (this.state === State.OPEN) {
+    if (true) {
       if (this.now() - this.openedAt >= this.cooldownMs) {
         this.state = State.HALF_OPEN;
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:45:11
 
   async execute(operation) {
     if (this.state === State.OPEN) {
-      if (this.now() - this.openedAt >= this.cooldownMs) {
+      if (false) {
         this.state = State.HALF_OPEN;
       } else {
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: CircuitOpenError: Circuit breaker aberto: chamadas ao gateway suspensas

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:45:11
 
   async execute(operation) {
     if (this.state === State.OPEN) {
-      if (this.now() - this.openedAt >= this.cooldownMs) {
+      if (true) {
         this.state = State.HALF_OPEN;
       } else {
killedBy: CircuitBreaker (RN07) falha rapido com CircuitOpenError enquanto aberto
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/CircuitBreaker.js:47:14
     if (this.state === State.OPEN) {
       if (this.now() - this.openedAt >= this.cooldownMs) {
         this.state = State.HALF_OPEN;
-      } else {
-        throw new CircuitOpenError();
-      }
+      } else {}
     }
 
killedBy: CircuitBreaker (RN07) falha rapido com CircuitOpenError enquanto aberto
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/CircuitBreaker.js:52:9
       }
     }
 
-    try {
-      const result = await operation();
-      this._onSuccess();
-      return result;
-    } catch (error) {
+    try {} catch (error) {
       this._onFailure();
       throw error;
killedBy: CircuitBreaker (RN07) inicia fechado e executa normalmente
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "ok"
Received: undefined

[Killed] BlockStatement
src/services/CircuitBreaker.js:56:21
       const result = await operation();
       this._onSuccess();
       return result;
-    } catch (error) {
-      this._onFailure();
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BlockStatement
src/services/CircuitBreaker.js:62:20
     }
   }
 
-  _record(success) {
-    this.results.push(success);
-    if (this.results.length > this.window) {
-      this.results.shift();
-    }
-  }
+  _record(success) {}
 
   _failureRatio() {
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:64:9
 
   _record(success) {
     this.results.push(success);
-    if (this.results.length > this.window) {
+    if (true) {
       this.results.shift();
     }
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] EqualityOperator
src/services/CircuitBreaker.js:64:9
 
   _record(success) {
     this.results.push(success);
-    if (this.results.length > this.window) {
+    if (this.results.length <= this.window) {
       this.results.shift();
     }
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BlockStatement
src/services/CircuitBreaker.js:69:19
     }
   }
 
-  _failureRatio() {
-    if (this.results.length === 0) return 0;
-    const failures = this.results.filter((ok) => !ok).length;
-    return failures / this.results.length;
-  }
+  _failureRatio() {}
 
   _onSuccess() {
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] EqualityOperator
src/services/CircuitBreaker.js:70:9
   }
 
   _failureRatio() {
-    if (this.results.length === 0) return 0;
+    if (this.results.length !== 0) return 0;
     const failures = this.results.filter((ok) => !ok).length;
     return failures / this.results.length;
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:70:9
   }
 
   _failureRatio() {
-    if (this.results.length === 0) return 0;
+    if (true) return 0;
     const failures = this.results.filter((ok) => !ok).length;
     return failures / this.results.length;
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BooleanLiteral
src/services/CircuitBreaker.js:71:50
 
   _failureRatio() {
     if (this.results.length === 0) return 0;
-    const failures = this.results.filter((ok) => !ok).length;
+    const failures = this.results.filter((ok) => ok).length;
     return failures / this.results.length;
   }
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] ArrowFunction
src/services/CircuitBreaker.js:71:42
 
   _failureRatio() {
     if (this.results.length === 0) return 0;
-    const failures = this.results.filter((ok) => !ok).length;
+    const failures = this.results.filter(() => undefined).length;
     return failures / this.results.length;
   }
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Survived] ArithmeticOperator
src/services/CircuitBreaker.js:72:12
   _failureRatio() {
     if (this.results.length === 0) return 0;
     const failures = this.results.filter((ok) => !ok).length;
-    return failures / this.results.length;
+    return failures * this.results.length;
   }
 

[Killed] BlockStatement
src/services/CircuitBreaker.js:75:16
     return failures / this.results.length;
   }
 
-  _onSuccess() {
-    this._record(true);
-    if (this.state === State.HALF_OPEN) {
-      this._reset();
-    }
-  }
+  _onSuccess() {}
 
   _onFailure() {
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Survived] BooleanLiteral
src/services/CircuitBreaker.js:76:18
   }
 
   _onSuccess() {
-    this._record(true);
+    this._record(false);
     if (this.state === State.HALF_OPEN) {
       this._reset();

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:77:9
 
   _onSuccess() {
     this._record(true);
-    if (this.state === State.HALF_OPEN) {
+    if (false) {
       this._reset();
     }
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Killed] EqualityOperator
src/services/CircuitBreaker.js:77:9
 
   _onSuccess() {
     this._record(true);
-    if (this.state === State.HALF_OPEN) {
+    if (this.state !== State.HALF_OPEN) {
       this._reset();
     }
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Killed] BlockStatement
src/services/CircuitBreaker.js:82:16
     }
   }
 
-  _onFailure() {
-    this._record(false);
-
-    if (this.state === State.HALF_OPEN) {
-      this._open();
-      return;
-    }
-
-    const enoughData = this.results.length >= this.minimumCalls;
-    if (enoughData && this._failureRatio() > this.errorThreshold) {
-      this._open();
-    }
-  }
+  _onFailure() {}
 
   _open() {
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BooleanLiteral
src/services/CircuitBreaker.js:83:18
   }
 
   _onFailure() {
-    this._record(false);
+    this._record(true);
 
     if (this.state === State.HALF_OPEN) {
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Survived] ConditionalExpression
src/services/CircuitBreaker.js:85:9
   _onFailure() {
     this._record(false);
 
-    if (this.state === State.HALF_OPEN) {
+    if (true) {
       this._open();
       return;

[Survived] EqualityOperator
src/services/CircuitBreaker.js:85:9
   _onFailure() {
     this._record(false);
 
-    if (this.state === State.HALF_OPEN) {
+    if (this.state !== State.HALF_OPEN) {
       this._open();
       return;

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:90:24
       return;
     }
 
-    const enoughData = this.results.length >= this.minimumCalls;
+    const enoughData = false;
     if (enoughData && this._failureRatio() > this.errorThreshold) {
       this._open();
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Survived] ConditionalExpression
src/services/CircuitBreaker.js:90:24
       return;
     }
 
-    const enoughData = this.results.length >= this.minimumCalls;
+    const enoughData = true;
     if (enoughData && this._failureRatio() > this.errorThreshold) {
       this._open();

[Killed] EqualityOperator
src/services/CircuitBreaker.js:91:23
     }
 
     const enoughData = this.results.length >= this.minimumCalls;
-    if (enoughData && this._failureRatio() > this.errorThreshold) {
+    if (enoughData && this._failureRatio() <= this.errorThreshold) {
       this._open();
     }
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BlockStatement
src/services/CircuitBreaker.js:91:67
     }
 
     const enoughData = this.results.length >= this.minimumCalls;
-    if (enoughData && this._failureRatio() > this.errorThreshold) {
-      this._open();
-    }
+    if (enoughData && this._failureRatio() > this.errorThreshold) {}
   }
 
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BlockStatement
src/services/CircuitBreaker.js:96:11
     }
   }
 
-  _open() {
-    this.state = State.OPEN;
-    this.openedAt = this.now();
-  }
+  _open() {}
 
   _reset() {
killedBy: CircuitBreaker (RN07) abre quando a taxa de falha excede o threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "OPEN"
Received: "CLOSED"

[Killed] BlockStatement
src/services/CircuitBreaker.js:101:12
     this.openedAt = this.now();
   }
 
-  _reset() {
-    this.state = State.CLOSED;
-    this.results = [];
-    this.openedAt = null;
-  }
+  _reset() {}
 }
 
killedBy: CircuitBreaker (RN07) fecha novamente apos sucesso em HALF_OPEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Survived] ArrayDeclaration
src/services/CircuitBreaker.js:103:20
 
   _reset() {
     this.state = State.CLOSED;
-    this.results = [];
+    this.results = ["Stryker was here"];
     this.openedAt = null;
   }

[Killed] ObjectLiteral
src/services/CircuitBreaker.js:110:18
 
 CircuitBreaker.State = State;
 
-module.exports = { CircuitBreaker, State };
+module.exports = {};
 
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: que o gateway de pagamento responde "APROVADO" (line 11)

CircuitBreaker is not a constructor
