[Killed] Regex
src/services/OrderValidator.js:5:23
 
 const { ValidationError } = require('../errors');
 
-const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_PATTERN = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
 
 /**
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] Regex
src/services/OrderValidator.js:5:23
 
 const { ValidationError } = require('../errors');
 
-const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
 
 /**
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/services/OrderValidator.js:13:20
  * Express handler so the rule is unit-testable and reusable.
  */
 class OrderValidator {
-  validate(pedido) {
-    if (!pedido || typeof pedido !== 'object') {
-      throw new ValidationError('Pedido ausente ou invalido', 'pedido');
-    }
-
-    const { clienteEmail, valor, cartao } = pedido;
-
-    if (!clienteEmail || !EMAIL_PATTERN.test(clienteEmail)) {
-      throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
-    }
-
-    if (typeof valor !== 'number' || Number.isNaN(valor) || valor <= 0) {
-      throw new ValidationError('Valor deve ser numerico e maior que zero', 'valor');
-    }
-
-    if (!cartao || typeof cartao !== 'object') {
-      throw new ValidationError('Dados do cartao ausentes', 'cartao');
-    }
-
-    return true;
-  }
+  validate(pedido) {}
 }
 
killedBy: Processamento de Checkout da EntregasJá Payload incompleto é rejeitado sem tocar a infraestrutura (Fluxo 5)
statusReason: Error: jest-cucumber: uma falha de validação deve ser lançada (line 40)

expect(received).toBeInstanceOf(expected)

Expected constructor: ValidationError

Received value has no prototype
Received value: null

[Killed] EqualityOperator
src/services/OrderValidator.js:14:20
  */
 class OrderValidator {
   validate(pedido) {
-    if (!pedido || typeof pedido !== 'object') {
+    if (!pedido || typeof pedido === 'object') {
       throw new ValidationError('Pedido ausente ou invalido', 'pedido');
     }
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] BooleanLiteral
src/services/OrderValidator.js:14:9
  */
 class OrderValidator {
   validate(pedido) {
-    if (!pedido || typeof pedido !== 'object') {
+    if (pedido || typeof pedido !== 'object') {
       throw new ValidationError('Pedido ausente ou invalido', 'pedido');
     }
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] LogicalOperator
src/services/OrderValidator.js:20:9
 
     const { clienteEmail, valor, cartao } = pedido;
 
-    if (!clienteEmail || !EMAIL_PATTERN.test(clienteEmail)) {
+    if (!clienteEmail && !EMAIL_PATTERN.test(clienteEmail)) {
       throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
     }
killedBy: OrderValidator (RN01) rejeita e-mail invalido
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/services/OrderValidator.js:20:9
 
     const { clienteEmail, valor, cartao } = pedido;
 
-    if (!clienteEmail || !EMAIL_PATTERN.test(clienteEmail)) {
+    if (false) {
       throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
     }
killedBy: OrderValidator (RN01) rejeita e-mail invalido
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Survived] StringLiteral
src/services/OrderValidator.js:21:33
     const { clienteEmail, valor, cartao } = pedido;
 
     if (!clienteEmail || !EMAIL_PATTERN.test(clienteEmail)) {
-      throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
+      throw new ValidationError("", 'clienteEmail');
     }
 

[Killed] LogicalOperator
src/services/OrderValidator.js:24:9
       throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
     }
 
-    if (typeof valor !== 'number' || Number.isNaN(valor) || valor <= 0) {
+    if ((typeof valor !== 'number' || Number.isNaN(valor)) && valor <= 0) {
       throw new ValidationError('Valor deve ser numerico e maior que zero', 'valor');
     }
killedBy: OrderValidator (RN01) rejeita valor zero ou negativo
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/services/OrderValidator.js:24:9
       throw new ValidationError('E-mail do cliente invalido', 'clienteEmail');
     }
 
-    if (typeof valor !== 'number' || Number.isNaN(valor) || valor <= 0) {
+    if (true) {
       throw new ValidationError('Valor deve ser numerico e maior que zero', 'valor');
     }
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: TypeError: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/services/OrderValidator.js:28:48
       throw new ValidationError('Valor deve ser numerico e maior que zero', 'valor');
     }
 
-    if (!cartao || typeof cartao !== 'object') {
-      throw new ValidationError('Dados do cartao ausentes', 'cartao');
-    }
+    if (!cartao || typeof cartao !== 'object') {}
 
     return true;
killedBy: CheckoutService — Fluxo 5: Validacao de Entrada (RN01) payload sem cartao lanca ValidationError
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"order": {"cartao": undefined, "clienteEmail": "cliente@entregasja.com", "id": 1, "status": "FALHOU", "valor": 100}, "reason": "pagamento_recusado", "success": false}

[Killed] EqualityOperator
src/services/OrderValidator.js:28:20
       throw new ValidationError('Valor deve ser numerico e maior que zero', 'valor');
     }
 
-    if (!cartao || typeof cartao !== 'object') {
+    if (!cartao || typeof cartao === 'object') {
       throw new ValidationError('Dados do cartao ausentes', 'cartao');
     }
killedBy: CheckoutService — Fluxo 1: Pagamento Aprovado (RN02) marca o pedido como PROCESSADO e retorna sucesso
statusReason: ValidationError: Dados do cartao ausentes

[Survived] StringLiteral
src/services/OrderValidator.js:29:61
     }
 
     if (!cartao || typeof cartao !== 'object') {
-      throw new ValidationError('Dados do cartao ausentes', 'cartao');
+      throw new ValidationError('Dados do cartao ausentes', "");
     }
 
