[Killed] ArrowFunction
src/services/retry.js:5:15
 
 const { InfrastructureError } = require('../errors');
 
-const sleep = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const sleep = () => undefined;
 
 /**
killedBy: retry (RN05/RN06) aguarda o backoff entre tentativas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 500
Received array: []

[Timeout] ArrowFunction
src/services/retry.js:5:35
 
 const { InfrastructureError } = require('../errors');
 
-const sleep = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const sleep = (ms) => new Promise(() => undefined);
 
 /**

[Killed] BlockStatement
src/services/retry.js:26:9
   backoffMs = 500,
   jitter = 0.2,
   random = Math.random,
-} = {}) {
-  let lastError;
-
-  for (let attempt = 0; attempt <= maxRetries; attempt += 1) {
-    try {
-      return await operation(attempt);
-    } catch (error) {
-      lastError = error;
-
-      const isRetryable = error instanceof InfrastructureError && error.retryable;
-      const hasAttemptsLeft = attempt < maxRetries;
-
-      if (!isRetryable || !hasAttemptsLeft) {
-        throw error;
-      }
-
-      const spread = backoffMs * jitter * random();
-      await sleep(backoffMs + spread);
-    }
-  }
-
-  throw lastError;
-}
+} = {}) {}
 
 module.exports = { retry };
killedBy: retry (RN05/RN06) retorna no primeiro sucesso sem reexecutar
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "ok"
Received: undefined

[Killed] EqualityOperator
src/services/retry.js:29:25
 } = {}) {
   let lastError;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt += 1) {
+  for (let attempt = 0; attempt < maxRetries; attempt += 1) {
     try {
       return await operation(attempt);
killedBy: retry (RN05/RN06) reexecuta ate maxRetries+1 vezes em falha de infra
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] EqualityOperator
src/services/retry.js:29:25
 } = {}) {
   let lastError;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt += 1) {
+  for (let attempt = 0; attempt > maxRetries; attempt += 1) {
     try {
       return await operation(attempt);
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"

[Killed] BlockStatement
src/services/retry.js:30:9
   let lastError;
 
   for (let attempt = 0; attempt <= maxRetries; attempt += 1) {
-    try {
-      return await operation(attempt);
-    } catch (error) {
+    try {} catch (error) {
       lastError = error;
 
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"

[Killed] BlockStatement
src/services/retry.js:32:21
   for (let attempt = 0; attempt <= maxRetries; attempt += 1) {
     try {
       return await operation(attempt);
-    } catch (error) {
-      lastError = error;
-
-      const isRetryable = error instanceof InfrastructureError && error.retryable;
-      const hasAttemptsLeft = attempt < maxRetries;
-
-      if (!isRetryable || !hasAttemptsLeft) {
-        throw error;
-      }
-
-      const spread = backoffMs * jitter * random();
-      await sleep(backoffMs + spread);
-    }
+    } catch (error) {}
   }
 
killedBy: retry (RN05/RN06) reexecuta ate maxRetries+1 vezes em falha de infra
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: InfrastructureError

Received function did not throw

[Killed] ConditionalExpression
src/services/retry.js:35:27
     } catch (error) {
       lastError = error;
 
-      const isRetryable = error instanceof InfrastructureError && error.retryable;
+      const isRetryable = true;
       const hasAttemptsLeft = attempt < maxRetries;
 
killedBy: retry (RN05/RN06) NAO reexecuta erros nao-retryable (ValidationError)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 4

[Killed] ConditionalExpression
src/services/retry.js:35:27
     } catch (error) {
       lastError = error;
 
-      const isRetryable = error instanceof InfrastructureError && error.retryable;
+      const isRetryable = false;
       const hasAttemptsLeft = attempt < maxRetries;
 
killedBy: Processamento de Checkout da EntregasJá Gateway instável se recupera na retentativa (Fluxo 3)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 27)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"

[Killed] EqualityOperator
src/services/retry.js:36:31
       lastError = error;
 
       const isRetryable = error instanceof InfrastructureError && error.retryable;
-      const hasAttemptsLeft = attempt < maxRetries;
+      const hasAttemptsLeft = attempt >= maxRetries;
 
       if (!isRetryable || !hasAttemptsLeft) {
killedBy: Processamento de Checkout da EntregasJá Gateway instável se recupera na retentativa (Fluxo 3)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 27)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"

[Killed] ConditionalExpression
src/services/retry.js:36:31
       lastError = error;
 
       const isRetryable = error instanceof InfrastructureError && error.retryable;
-      const hasAttemptsLeft = attempt < maxRetries;
+      const hasAttemptsLeft = false;
 
       if (!isRetryable || !hasAttemptsLeft) {
killedBy: Processamento de Checkout da EntregasJá Gateway instável se recupera na retentativa (Fluxo 3)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 27)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"

[Killed] ConditionalExpression
src/services/retry.js:38:11
       const isRetryable = error instanceof InfrastructureError && error.retryable;
       const hasAttemptsLeft = attempt < maxRetries;
 
-      if (!isRetryable || !hasAttemptsLeft) {
+      if (true) {
         throw error;
       }
killedBy: retry (RN05/RN06) reexecuta ate maxRetries+1 vezes em falha de infra
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 1

[Killed] BooleanLiteral
src/services/retry.js:38:11
       const isRetryable = error instanceof InfrastructureError && error.retryable;
       const hasAttemptsLeft = attempt < maxRetries;
 
-      if (!isRetryable || !hasAttemptsLeft) {
+      if (isRetryable || !hasAttemptsLeft) {
         throw error;
       }
killedBy: retry (RN05/RN06) reexecuta ate maxRetries+1 vezes em falha de infra
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 1

[Killed] ArithmeticOperator
src/services/retry.js:42:22
         throw error;
       }
 
-      const spread = backoffMs * jitter * random();
+      const spread = backoffMs / jitter * random();
       await sleep(backoffMs + spread);
     }
killedBy: retry (RN05/RN06) aguarda o backoff entre tentativas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 500
Received array: [NaN]

[Killed] ArithmeticOperator
src/services/retry.js:42:22
         throw error;
       }
 
-      const spread = backoffMs * jitter * random();
+      const spread = backoffMs * jitter / random();
       await sleep(backoffMs + spread);
     }
killedBy: retry (RN05/RN06) aguarda o backoff entre tentativas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 500
Received array: [NaN]

[Survived] ArithmeticOperator
src/services/retry.js:43:19
       }
 
       const spread = backoffMs * jitter * random();
-      await sleep(backoffMs + spread);
+      await sleep(backoffMs - spread);
     }
   }

[Killed] ObjectLiteral
src/services/retry.js:50:18
   throw lastError;
 }
 
-module.exports = { retry };
+module.exports = {};
 
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "ERRO_GATEWAY"
