[Killed] BlockStatement
src/services/withTimeout.js:12:53
  */
 function withTimeout(promise, timeoutMs) {
   let timer;
-  const timeout = new Promise((_resolve, reject) => {
-    timer = setTimeout(() => reject(new TimeoutError(timeoutMs)), timeoutMs);
-  });
+  const timeout = new Promise((_resolve, reject) => {});
 
   return Promise.race([promise, timeout]).finally(() => clearTimeout(timer));
killedBy: withTimeout (RN04) rejeita com TimeoutError quando excede o limite
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "tarde"

[Killed] ArrowFunction
src/services/withTimeout.js:13:24
 function withTimeout(promise, timeoutMs) {
   let timer;
   const timeout = new Promise((_resolve, reject) => {
-    timer = setTimeout(() => reject(new TimeoutError(timeoutMs)), timeoutMs);
+    timer = setTimeout(() => undefined, timeoutMs);
   });
 
killedBy: withTimeout (RN04) rejeita com TimeoutError quando excede o limite
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "tarde"

[Killed] ArrowFunction
src/services/withTimeout.js:16:51
     timer = setTimeout(() => reject(new TimeoutError(timeoutMs)), timeoutMs);
   });
 
-  return Promise.race([promise, timeout]).finally(() => clearTimeout(timer));
+  return Promise.race([promise, timeout]).finally(() => undefined);
 }
 
killedBy: withTimeout (RN04) limpa o timer apos resolver (nao vaza handles)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] ArrayDeclaration
src/services/withTimeout.js:16:23
     timer = setTimeout(() => reject(new TimeoutError(timeoutMs)), timeoutMs);
   });
 
-  return Promise.race([promise, timeout]).finally(() => clearTimeout(timer));
+  return Promise.race([]).finally(() => clearTimeout(timer));
 }
 
