[Killed] StringLiteral
src/domain/OrderStatus.js:6:14
 /** Persisted order states (RN02, RN03, RN07). */
 const OrderStatus = Object.freeze({
   PENDING: 'PENDENTE',
-  PROCESSED: 'PROCESSADO',
+  PROCESSED: "",
   FAILED: 'FALHOU',
   GATEWAY_ERROR: 'ERRO_GATEWAY',
killedBy: Processamento de Checkout da EntregasJá Pagamento aprovado dispara confirmação (Fluxo 1)
statusReason: Error: jest-cucumber: o pedido deve ter status "PROCESSADO" (line 13)

expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: ""

[Killed] StringLiteral
src/domain/OrderStatus.js:8:18
   PENDING: 'PENDENTE',
   PROCESSED: 'PROCESSADO',
   FAILED: 'FALHOU',
-  GATEWAY_ERROR: 'ERRO_GATEWAY',
+  GATEWAY_ERROR: "",
 });
 
killedBy: Processamento de Checkout da EntregasJá Queda total do gateway aciona fallback (Fluxo 4)
statusReason: Error: jest-cucumber: o pedido deve ter status "ERRO_GATEWAY" (line 33)

expect(received).toBe(expected) // Object.is equality

Expected: "ERRO_GATEWAY"
Received: ""

[Survived] StringLiteral
src/domain/OrderStatus.js:14:13
 /** Gateway response codes. Anything not APPROVED is a business decline (RN03). */
 const GatewayStatus = Object.freeze({
   APPROVED: 'APROVADO',
-  DECLINED: 'RECUSADO',
+  DECLINED: "",
   INSUFFICIENT_FUNDS: 'SALDO_INSUFICIENTE',
   EXPIRED_CARD: 'CARTAO_EXPIRADO',

[Survived] StringLiteral
src/domain/OrderStatus.js:15:23
 const GatewayStatus = Object.freeze({
   APPROVED: 'APROVADO',
   DECLINED: 'RECUSADO',
-  INSUFFICIENT_FUNDS: 'SALDO_INSUFICIENTE',
+  INSUFFICIENT_FUNDS: "",
   EXPIRED_CARD: 'CARTAO_EXPIRADO',
 });

[Survived] StringLiteral
src/domain/OrderStatus.js:16:17
   APPROVED: 'APROVADO',
   DECLINED: 'RECUSADO',
   INSUFFICIENT_FUNDS: 'SALDO_INSUFICIENTE',
-  EXPIRED_CARD: 'CARTAO_EXPIRADO',
+  EXPIRED_CARD: "",
 });
 
