[Killed] ArithmeticOperator
src/services/CircuitBreaker.js:45:11
 
   async execute(operation) {
     if (this.state === State.OPEN) {
-      if (this.now() - this.openedAt >= this.cooldownMs) {
+      if (this.now() + this.openedAt >= this.cooldownMs) {
         this.state = State.HALF_OPEN;
       } else {
killedBy: CircuitBreaker — cooldown e HALF_OPEN usa subtracao correta no calculo do cooldown (now - openedAt)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "ok"

[Killed] EqualityOperator
src/services/CircuitBreaker.js:64:9
 
   _record(success) {
     this.results.push(success);
-    if (this.results.length > this.window) {
+    if (this.results.length >= this.window) {
       this.results.shift();
     }
killedBy: CircuitBreaker — abertura por limiar (RN07) NAO abre quando a taxa de falha fica NO limiar (precisa ser estritamente maior)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "OPEN"

[Killed] ConditionalExpression
src/services/CircuitBreaker.js:70:9
   }
 
   _failureRatio() {
-    if (this.results.length === 0) return 0;
+    if (false) return 0;
     const failures = this.results.filter((ok) => !ok).length;
     return failures / this.results.length;
killedBy: CircuitBreaker — caminho fechado normal _failureRatio retorna 0 com a janela vazia
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] MethodExpression
src/services/CircuitBreaker.js:71:22
 
   _failureRatio() {
     if (this.results.length === 0) return 0;
-    const failures = this.results.filter((ok) => !ok).length;
+    const failures = this.results.length;
     return failures / this.results.length;
   }
killedBy: CircuitBreaker — abertura por limiar (RN07) NAO abre quando a taxa de falha fica NO limiar (precisa ser estritamente maior)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "OPEN"

[Killed] EqualityOperator
src/services/CircuitBreaker.js:90:24
       return;
     }
 
-    const enoughData = this.results.length >= this.minimumCalls;
+    const enoughData = this.results.length < this.minimumCalls;
     if (enoughData && this._failureRatio() > this.errorThreshold) {
       this._open();
killedBy: CircuitBreaker — abertura por limiar (RN07) NAO abre antes de atingir minimumCalls, mesmo com 100% de falha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "OPEN"

[Killed] LogicalOperator
src/services/CircuitBreaker.js:91:9
     }
 
     const enoughData = this.results.length >= this.minimumCalls;
-    if (enoughData && this._failureRatio() > this.errorThreshold) {
+    if (enoughData || this._failureRatio() > this.errorThreshold) {
       this._open();
     }
killedBy: CircuitBreaker — abertura por limiar (RN07) NAO abre antes de atingir minimumCalls, mesmo com 100% de falha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "OPEN"
