[Killed] Regex
src/services/OrderValidator.js:5:23
 
 const { ValidationError } = require('../errors');
 
-const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_PATTERN = /^[^\s@]+@[^\s@]+\.[^\s@]+/;
 
 /**
killedBy: OrderValidator (RN01) rejeita e-mail com lixo apos um endereco valido (ancora $)
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] LogicalOperator
src/services/OrderValidator.js:14:9
  */
 class OrderValidator {
   validate(pedido) {
-    if (!pedido || typeof pedido !== 'object') {
+    if (!pedido && typeof pedido !== 'object') {
       throw new ValidationError('Pedido ausente ou invalido', 'pedido');
     }
killedBy: OrderValidator (RN01) rejeita pedido nao-objeto: null
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ValidationError
Received constructor: TypeError
